const test = {
    "filter": [
        "อะกิ",
        "เป้",
        "เคน",
        "แชร์",
        "แชท",
        "เจลาย",
        "ปังย่า",
        "มีน",
        "ต๊อตติ",
        "บ๋อม",
        "ยู",
        "ชุ",
        "แจน",
        "พีท",
        "มุกดา",
        "แพท",
        "กะทิ",
        "กร",
        "เซ้นท์",
        "โอม",
        "ไวศ์",
        "ไทนี่",
        "เอิร์ท"
    ],
    "all": [
        "ปังย่า",
        "เคน",
        "แชร์",
        "ตาต้าร์",
        "มุกดา",
        "ชุ",
        "กะทิ",
        "เอิร์ท",
        "เซ้นท์",
        "อะกิ",
        "นโม",
        "โอม",
        "เป้",
        "เจลาย",
        "มีน",
        "กร",
        "พีท",
        "แจน",
        "ปัง",
        "ไวศ์",
        "บ๋อม",
        "ยู",
        "ไทนี่",
        "ต๊อตติ",
        "แชท",
        "แพท"
    ],
    "result": []
}
temp = "";
test.all.forEach(name => {
    temp = name;
    test.filter.forEach(filter => {
        temp = temp.replace(filter, "");
    });
    test.result[test.result.length] = temp
    // console.log(temp);
});
console.log(test.result);